<!DOCTYPE html>
<html lang="de">

<head>
        <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
        <meta name="viewport" content= "width=device-width, initial-scale=1.0"/>
        <link rel="stylesheet" type="text/css" href="./index.css">
        <link rel="stylesheet" type="text/css" href="./about.css">
        <link rel="stylesheet" type="text/css" href="./project.css">
        <link rel="stylesheet" type="text/css" href="./footer.css">
        <link href="https://fonts.googleapis.com/css?family=Poppins" rel="stylesheet">
        <link rel="shortcut icon" href="#">
        <link rel = "icon" href="./src/logo.png" type="image/x-icon">
        <title> Gabriel Maljas </title>
</head>
<script src="three.r119.min.js"></script>
<script src="vanta.dots.min.js"></script>

<body>
  <nav>
    <a href = "#about" >
    <div class = "logo">
      <h4> Portfolio </h4>
    </div>
    </a>
    <ul class="nav-links">
      <li>
        <a href = "#about"> &Uuml;ber</a>
      </li>
      <li>
        <a href = "#projects">Projekte</a>
      </li>
      <li>
        <a href = "./index.html"><img id = "DE" alt ="DE" src = "./src/DE.png"></img></a>
        <a href = "./en.html"><img id = "EN" alt ="EN" src = "./src/EN.png"></img></a>
      </li>
      
    </ul>
    <div class="burger">
      <div class="line1"></div>
      <div class="line2"></div>
      <div class="line3"></div>
    </div>
  </nav>
  <main>
    <div id = "about" class = "about">
        <script>
            VANTA.DOTS({
              el: "#about",
              mouseControls: true,
              touchControls: true,
              gyroControls: false,
              minHeight: 200.00,
              minWidth: 200.00,
              scale: 1.00,
              scaleMobile: 1.00,
              color: 0xa7a7a7,
              color2: 0xf2f2f2,
              backgroundColor: 0x0,
              size: 3.00,
              spacing: 17.00
            })
        </script>
        <div class= "infos">
            <h1>Gabriel Maljas </h1>
            <img id= "Picture" alt = "Portait" src = "./src/PassBildRund.png"></img>
            <h2>Game- und Webentwickler </h2>
            <h3>Ich bin ein Programmierer in Ausbildung aus Heidelberg<h3>
        </div>
    </div>
    <div class = "work">
        <div class = "headline">
            <h1 class = "games">Spiele</h1>
            <ul class = "projectlist">
                <li id = "oceanssilence">Ocean's Silence</li>
                <li id = "masks">Masks</li>
                <li id = "ingredientwars">Ingredient Wars</li>
            </ul>
            <h1 class = "websites">Webseiten</h1>
             <ul class = "projectlist">
                <li id = "nostalgames">Nostal Games</li>
                <li id = "portfolio">Portfolio</li>
            </ul>
        </div>
        
        <div id = "projects" class = "projects">
            <div id = "masks" class = "masks">
                <div class = "description">
                    <h3> Masks </h3>
                    <h1> Beschreibung </h1>
                    <h2> Masks ist ein Action-/ Abenteuerspiel, welches f&uuml;r ein zwei w&ouml;chiges Schulprojekt entwickelt wurde. <br> Das Spiel handelt von einer Piratin, welche auf geheimen Inseln nach Sch&auml;tzen sucht 
                    . Doch auf dieser Insel entdeckt sie Geister, die ihr neue F&auml;higkeiten geben.</h2>
                    <h1> Projektaufgabe</h1>
                    <h2> 
                    In diesem Projekt war der Auftrag aus den Worten &quot;Insel&quot;, &quot;Geist&quot; und &quot;Schatz&quot; mit der <a href="https://unity.com/de/our-company" style="text-decoration: none;color: rgb(112, 112, 112);"> Game-Engine Unity </a> und C# ein Spiel zu erstellen.  
                    <br> Inspiration f&uuml;r dieses Spiel habe ich dann zum Teil aus dem Film <a href="https://de.wikipedia.org/wiki/Chihiros_Reise_ins_Zauberland" style="text-decoration: none;color: rgb(112, 112, 112);"> &quot;Chihiros Reise ins Zauberland&quot; </a>  genommen. 
                    Die Geister in Masks sind dem  <a href="#noface" style="text-decoration: none;color: rgb(112, 112, 112); "> Ungesicht </a> aus diesem Film nachempfunden. Das Ungesicht 
                    und die Geister haben beide nicht wirklich einen K&ouml;rper und haben auch Masken als Gesicht. Da ich auch das Thema &quot;Elemente&quot; aufnehmen wollte, habe ich mich von der Nickelodeon Serie <a href = "https://de.wikipedia.org/wiki/Avatar_%E2%80%93_Der_Herr_der_Elemente"  style="text-decoration: none;color: rgb(112, 112, 112);">&quot;Avatar 
                    der Herr der Elemente&quot;</a> inspirieren lassen, um F&auml;higkeiten f&uuml;r mein Spiel zu finden. Zum Beispiel das  <a href="#aang" style="text-decoration: none;color: rgb(112, 112, 112); "> Reiten auf der Wolke </a> ist aus dieser Serie nachempfunden.</h2>
                    <div style="width: 50%;">
                        <img id="noface" src= "./src/noface.png" alt = "NoFace"></img> 
                        <img id="aang" src= "./src/aangairball.png" alt = "Avatar"></img> 
                    </div>
                    <h1> Game-Trailer</h1>
                </div>
                <div class = "video-bereich">
                    <iframe  class = "video-extern" src="https://www.youtube.com/embed/tZsfTn71MiY"  frameborder="0"  allowfullscreen></iframe>
                </div>
                <div class = "description">
                
                    <h1> Gestaltung</h1>
                    <h4> Die Geister</h4>
                    <h2>Mit dem 3D-Modellierungstool <a href="https://www.blender.org/about/" style="text-decoration: none;color: rgb(112, 112, 112);"> Blender </a> 
                    habe ich Elementar-Geister modelliert und in mein Projekt eingebaut.
                     <br> Im linken Bild ist der Wasser-Geist zu sehen, welcher sich im Wasser befindet. Im rechten Bild ist der Feuer-Geist zu sehen, welcher am ganzen K&ouml;rper brennt.</h2>
                    <div>
                        <img src="./src/waterghost.png" alt = "Wasser Geist"></img>
                        <img src="./src/fireghost.png" alt = "Feuer Geist"></img>
                    </div>
                    <h4> Die F&auml;higkeiten</h4>
                    <h2>Der Hauptcharakter bekommt durch das Besiegen der Geister neue F&auml;higkeiten, die je nach dem besiegten Gegner anders sind.</h2> 
                    <h5> Mauer aus der Erde </h5>
                    <img src="./src/wall.png" alt = "Fähigkeit Mauer"></img>
                    <h5> Wolke zum schweben </h5>
                    <img src="./src/cloud.png" alt = "Fähigkeit Wolke"></img>
                    <h1> Code Ausschnitte</h1>
                        <h4> Positionierung der Kamera mit zwei Ankerpunkten<img style="width:100%;" src = "./src/maskscode1.png" alt="Code1"></img> </h4>

                </div>
            </div>


            <div id = "oceanssilence" class = "oceanssilence">
                <div class = "description">
                    <h3> Ocean's Silence </h3>
                    <h1> Beschreibung </h1>
                        <h2> Ocean&apos;s Silence ist mein erstes Projekt mit der<a href="https://unity.com/de/our-company" style="text-decoration: none;color: silver;"> Game-Engine Unity
                        </a>. Das Projekt wurde mit C# geschrieben und die Objekte im Spiel sind aus dem Unity-Asset Store entnommen.</h2> 
                    <h1> Projektaufgabe</h1>
                        <h2>In dieser Projektaufgabe musste ein Horrorspiel aus der Ego-Perspektive aufgebaut und mit C# programmiert werden. 
                        Die Aufgabe war relativ offen und es war einem selbst &uuml;berlassen, was f&uuml;r eine Art Horrorspiel
                        erstellt wird. Das einzige zu Beachten war, dass ein Labyrinth und eine Ruine im Spiel vorhanden sein soll. </h2>
                    <h1> Game-Trailer</h1>
                </div>
                <div class = "video-bereich">
                    <iframe  class = "video-extern" src="https://www.youtube.com/embed/3RhZljMXVgg"  frameborder="0"  allowfullscreen></iframe>
                </div>
                <div class = "description" style= "width: 100%;"> 
                    <h1> Gestaltung</h1>
                    <h2>   In diesem Projekt habe ich mich f&uuml;r eine Wasserumgebung entschieden. Durch ein konstantes Ger&auml;usch von Wasser sollte ein bedr&uuml;ckendes Gef&uuml;hl herrschen. 
                    Dies sollte gleichzeitig ruhig sein, aber auch schon zu ruhig. Denn wenn etwas in der Umgebung passiert, wird der Spieler direkt darauf aufmerksam.</h2>
                    <h4> Die versteckte Ruine </h4>
                    <h2> Die Ruine ist im Spiel anfangs im Sand vergraben und wird nach l&ouml;sen von R&auml;tseln auftauchen. Diese soll einen zerst&ouml;rten Tempel darstellen, welcher weitere geheime Hinweise f&uuml;r den Hauptcharakter gibt.</h2> 
                    <img src = "./src/ruine.png" alt = "Ruine"> </img>

                    
                    <h4> Die Treppe </h4>
                     <h2> Da ich zu der Zeit noch nicht sehr viel programmieren konnte, habe ich mich vorallem mit Animationen und Soundeffekten besch&auml;ftigt. Hier habe ich eine Treppe modelliert, welche sich zeigen l&auml;sst, sobald etwas gefunden wird. </h2>
                     <img src = "./src/steps.gif" alt = "Treppe"> </img>

                    <h4> Das Layrinth </h4>
                    <h2> Das Labyrinth ist ebenfalls am Anfang des Spiels auch nicht zu sehen, diese taucht erst auf wenn der Spieler auf der Spitze der Treppe ist. 
                    In diesem Labyrinth befindet sich der Schatz und ein Monster das auf einen am Ende wartet</h2>
                    <img src = "./src/labyrinth.png" alt = "Labyrinth"> </img>
                </div>
            </div>


            <div id = "ingredientwars" class = "ingredientwars">
                <div class = "description">
                    <h3> Ingredient Wars </h3>
                    <h1> Beschreibung </h1>
                        <h2> Ingredient Wars war mein erstes Projekt mit der Open Source Implementation 
                        vom Microsoft XNA 4 Framework <a href="https://www.monogame.net/about/" style="text-decoration: none;color: silver;">MonoGame</a>
                         und wurde mit C# geschrieben. </h2>
                      <h1> Projektaufgabe</h1>
                        <h2>Die Aufgabe des Projektes war das Erstellen eines Spiels mit dem 
                        Framework <a href="https://www.monogame.net/about/" style="text-decoration: none;color: silver;">MonoGame</a> 
                        und eines durch Zufall ausgew&auml;hlten Themas. In diesem Projekt hatte ich das Thema "Geheime Formel" bekommen. 
                        <br>Da ich ein gro&szlig;er Fan des Spiels <a href="https://www.ea.com/de-de/games/plants-vs-zombies" style="text-decoration: none;color:silver;">&quot;Plants vs. Zombies&quot;</a> von dem Publisher EA bin, 
                        habe ich mich entschieden ein Spiel mit &auml;hnlicher Spielemechanik zu erstellen. <br>
                        Um das Thema des Projektes zu erf&uuml;llen habe ich ein Konzept entwickelt mit der Idee, dass Nahrungsmittel sich gegen 
                        K&ouml;che wehren und diese von den geheimen Rezeptformeln fern halten wollen. </h2>
                     <h1> Game-Trailer</h1>
                </div>
                <div class = "video-bereich">
                    <iframe  class = "video-extern"  src="https://www.youtube.com/embed/CP1qqzJ0voE"  frameborder="0"  allowfullscreen></iframe>
                </div>
                <div class = "description">
                   
                    <h1> Gestaltung</h1>
                    <h4> Die Figuren </h4>
                        <h2>
                        Die Figuren sollten eine einfache und lustige Gestalt haben. Zum Beispiel habe ich mich f&uuml;r eine Kokosnuss entschieden die mehr Schaden nehmen kann, da diese auch eine harte H&uuml;lle besitzt.
                        Weiterhin habe ich eine Banane als rutschiges Hindernis ausgesucht, welches die Feinde zu Fall bringt. <br>Die Tomate ist die Haupteinheit meines Spieles, weil diese konstant Geschosse schie&szlig;en
                        um den Gegnern Schaden zuzuf&uuml;gen.
                        </h2>
                    <div style="width:30%;">
                        <img src = "./src/kokosnuss.png" alt = "Kokosnuss"> </img>
                        <img src = "./src/banane.png" alt = "Banane"> </img>
                        <img src = "./src/tomate.png" alt = "Tomate"> </img>
                    </div>
                    <h4> Das Spielfeld </h4>
                        <h2> Das Design des Spielfelds habe ich an einer K&uuml;che angelehnt. Der Fu&szlig;boden soll die Fliesen in einer K&uuml;che darstellen. 
                        <br>Der obere und untere Teil der Fliesen soll durch den &Uuml;bergang von dunklen zu hellen Farben einen Glanz-Effekt erzeugen.
                        <br>Die Fl&auml;che im oberen und unteren Teil des Spielfelds soll die Arbeitsfl&auml;chen der K&uuml;che darstellen, von wo aus auch die Nahrungsmittel aufgenommen werden und auf den Boden gesetzt werden.
                        <h2>
                        <img src = "./src/Spielfeld.png" alt = "Spielfeld"> </img>
                    <h1> Code Ausschnitte</h1>
                        <h4> Instantiieren eines Projektils<img style="width:100%;" src = "./src/ingredientwarscode1.png" alt="Code1"></img> </h4>
                        <h4> Zielfindung eines Gegners und instatiieren eines Projektils<img style="width:100%;" src = "./src/ingredientwarscode2.png" alt="Code2"></img> </h4>

                </div>
            </div>


            <div id = "nostalgames" class = "nostalgames">
                <div class = "description">
                    <h3> Nostal Games </h3>
                    <h4>Beschreibung</h4>
                    <h2>Nostal Games ist eine Webseite, welche Infos &uuml;ber Retro-Games gibt und auch das Spiel kurz anspielen l&auml;sst.
                    Dies war auch das erste Webprojekt, was als 2er Gruppenprojekt nur mit HTML und CSS gebaut wurde.</h2>
                    <h4> Projektaufgabe </h4>
                    <h2> Die Projektaufgabe war eine Webseite mit HTML und CSS zu bauen, welche eine Art Bibliothek f&uuml;r Retro-Games bereitstellen soll. 
                    Diese Seite sollte Informationen &uuml;ber diese Spiele enthalten und musste eine Art Forum enthalten. 
                    Dazu sollte man Kategorien einf&uuml;gen, welche die Spiele je nach Genre leichter finden l&auml;sst.
                    <h4> Gestaltung </h4>
                    <h2> Mein Gruppenpartner und ich haben uns entschieden die Webseite dem Stil von alten DOS nachzuempfinden um ein Retro-Aussehen zu erzeugen. Gepaart mit den alten Spielen und dem Retro-Look kann
                    klar gesagt werden, auf was die Webseite spezialisiert ist.</h2>
                    <h5>Frontpage</h5>
                    <h2> Auf der Frontpage ist oben das Logo und der Name der Webseite angezeigt. Darunter sind die potenziell beliebtesten Spiele zu sehen, welche dann von der Webseite 
                    beworben werden f&uuml;r einen schnellen und einfachen Zugang. </h2> 
                        <img src = "./src/nostalgames.png" alt = "NostalGames Hauptseite"> </img>
                        <img src = "./src/nostalgamesgame.png" alt = "NostalGames Spielbeispiel"> </img>
                    <h5>Forum</h5>
                    <h2> Das Forum war eine Art Beispiel wie es aussehen k&ouml;nnte. Es ist m&ouml;glich auf die Beitr&auml;gtitel zu klicken und die Beispiel Beitr&auml;ge zu lesen. </h2>
                     <img src = "./src/nostalgamesforum.png" alt = "NostalGames Forum"> </img>
                     <img src = "./src/nostalgamesforumbeitrag.png" alt = "NostalGames Forum Beitrag"> </img>
                </div>
            </div>


            <div id = "portfolio" class = "portfolio">
                <div class = "description">
                    <h3> Portfolio </h3>
                </div>
                <div class = "description">
                    <h1> JavaScript Beispiele aus dieser Webseite </h1>
                    <h4>Navigationsleistencode in der mobilen Version </h2>
                    <h2>Durch diesen JavaScript-Code kann man navLinks dynamisch einf&uuml;gen ohne etwas am Code &auml;ndern zu m&uuml;ssen. Diese fliegen von Rechts in der Reihenfolge vom Index-Wert des jeweiligen NavLinks. </h2>
                    <img src = "./src/portfoliocode2.png" alt = "Portfolio Code 1"> </img>

                    <h4> "Slide" hin und zur&uuml;ck in der mobilen Version</h2>
                    <h2> Wenn ein Projekt in der mobilen Version ausgew&aumlt wurde, ist es m&ouml;glich durch wischen zur&uuml;ck zur Projektauswahl zu gelangen. <br>Hier habe ich gemessen wann ein Wischen vom Benutzer durchgef&uuml;hrt wurde. 
                    Wenn ein Wischen durchgef&uuml;hrt wurde soll das Fenster mit dem Projekt zur&uuml;ck gleiten und deaktiviert werden. </h2>
                    <img src = "./src/portfoliocode1.png" alt = "Portfolio Code 2"> </img>

                </div>
                    
            </div>
        </div>         
    <div>
  </main>
  <footer>
        <h1> Kontakt: </h1>
        <div id= "icons">
            <a href = "https://www.linkedin.com/in/gabriel-maljas-2869a1200"> <img src="./src/linkedinlogo.png"></img> </a>
            <a href = "mailto:gabriel.maljas@web.de"> <img src="./src/mail.png"></img> </a>
        </div>
        <h1> Handcrafted by me </h1>
  </footer>
  <script src="app.js"></script>
</body>
</html>
